app/controllers/session_controller.rb

INSERT INTO "users" ("name", "updated_at", "oauth_token", "oauth_secret", "email", "created_at") VALUES('mahi mahi', '2009-04-06 07:29:20', '1/mcV9BZcHBWGQh7WCSR-WbQ', '7YPdLA9TbS4wokss7zA5NZ7t', 'mahimahi.corp@gmail.com', '2009-04-06 07:29:20')
SELECT "users".id FROM "users" WHERE ("users"."email" = 'mahimahi.corp@gmail.com') LIMIT 1
---
  def create
    request_token = OAuth::RequestToken.new(get_consumer, params[:oauth_token], session[:oauth_secret])
    access_token = request_token.get_access_token
    xml = XmlSimple.xml_in(access_token.get("https://www.google.com/m8/feeds/contacts/default/full/").body)
    email = xml["author"].first["email"].first
    user = User.find_or_create_by_email(email)